soapmessages/checkRetrieveStatusRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<env:Header>
		<SessionHeader xmlns="http://soap.sforce.com/2006/04/metadata">
			<sessionId>
				00DR00000000MZ6!AR4AQJF6PKt6N.TWfbblHiTw4KUFednjQmxEsnX1ltrUz12O5hINAPzgOpjmyS06SyXt6fvjdTaXVxTpFh_m8HY9O.n0Kgie
			</sessionId>
		</SessionHeader>
	</env:Header>
	<env:Body>
		<m:checkRetrieveStatus xmlns:m="http://soap.sforce.com/2006/04/metadata" xmlns:sobj="null">
			<m:asyncProcessId>
				09SR000000001DYMAY
			</m:asyncProcessId>
		</m:checkRetrieveStatus>
	</env:Body>
</env:Envelope>
